---
type: OverrideGraphicSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 47
tags: [revit-api, class]
---

# OverrideGraphicSettings

`Autodesk.Revit.DB.OverrideGraphicSettings` · Revit 2024 · 47 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | OverrideGraphicSettings | — | `` |
| Constructor | OverrideGraphicSettings | 2014 | `public OverrideGraphicSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | SetCutBackgroundPatternColor | 2019 | `public OverrideGraphicSettings SetCutBackgroundPatternColor ( Color color )` |
| Method | SetCutBackgroundPatternId | 2019 | `public OverrideGraphicSettings SetCutBackgroundPatternId ( ElementId fillPatternId )` |
| Method | SetCutBackgroundPatternVisible | 2019 | `public OverrideGraphicSettings SetCutBackgroundPatternVisible ( bool fillPatternVisible )` |
| Method | SetCutForegroundPatternColor | 2019 | `public OverrideGraphicSettings SetCutForegroundPatternColor ( Color color )` |
| Method | SetCutForegroundPatternId | 2019 | `public OverrideGraphicSettings SetCutForegroundPatternId ( ElementId fillPatternId )` |
| Method | SetCutForegroundPatternVisible | 2019 | `public OverrideGraphicSettings SetCutForegroundPatternVisible ( bool fillPatternVisible )` |
| Method | SetCutLineColor | 2014 | `public OverrideGraphicSettings SetCutLineColor ( Color color )` |
| Method | SetCutLinePatternId | 2014 | `public OverrideGraphicSettings SetCutLinePatternId ( ElementId linePatternId )` |
| Method | SetCutLineWeight | 2014 | `public OverrideGraphicSettings SetCutLineWeight ( int lineWeight )` |
| Method | SetDetailLevel | 2014 | `public OverrideGraphicSettings SetDetailLevel ( ViewDetailLevel detailLevel )` |
| Method | SetHalftone | 2014 | `public OverrideGraphicSettings SetHalftone ( bool halftone )` |
| Method | SetProjectionLineColor | 2014 | `public OverrideGraphicSettings SetProjectionLineColor ( Color color )` |
| Method | SetProjectionLinePatternId | 2014 | `public OverrideGraphicSettings SetProjectionLinePatternId ( ElementId linePatternId )` |
| Method | SetProjectionLineWeight | 2014 | `public OverrideGraphicSettings SetProjectionLineWeight ( int lineWeight )` |
| Method | SetSurfaceBackgroundPatternColor | 2019 | `public OverrideGraphicSettings SetSurfaceBackgroundPatternColor ( Color color )` |
| Method | SetSurfaceBackgroundPatternId | 2019 | `public OverrideGraphicSettings SetSurfaceBackgroundPatternId ( ElementId fillPatternId )` |
| Method | SetSurfaceBackgroundPatternVisible | 2019 | `public OverrideGraphicSettings SetSurfaceBackgroundPatternVisible ( bool fillPatternVisible )` |
| Method | SetSurfaceForegroundPatternColor | 2019 | `public OverrideGraphicSettings SetSurfaceForegroundPatternColor ( Color color )` |
| Method | SetSurfaceForegroundPatternId | 2019 | `public OverrideGraphicSettings SetSurfaceForegroundPatternId ( ElementId fillPatternId )` |
| Method | SetSurfaceForegroundPatternVisible | 2019 | `public OverrideGraphicSettings SetSurfaceForegroundPatternVisible ( bool fillPatternVisible )` |
| Method | SetSurfaceTransparency | 2014 | `public OverrideGraphicSettings SetSurfaceTransparency ( int transparency )` |
| Property | CutBackgroundPatternColor | 2019 | `public Color CutBackgroundPatternColor { get ; }` |
| Property | CutBackgroundPatternId | 2019 | `public ElementId CutBackgroundPatternId { get ; }` |
| Property | CutForegroundPatternColor | 2019 | `public Color CutForegroundPatternColor { get ; }` |
| Property | CutForegroundPatternId | 2019 | `public ElementId CutForegroundPatternId { get ; }` |
| Property | CutLineColor | 2014 | `public Color CutLineColor { get ; }` |
| Property | CutLinePatternId | 2014 | `public ElementId CutLinePatternId { get ; }` |
| Property | CutLineWeight | 2014 | `public int CutLineWeight { get ; }` |
| Property | DetailLevel | 2014 | `public ViewDetailLevel DetailLevel { get ; }` |
| Property | Halftone | 2014 | `public bool Halftone { get ; }` |
| Property | InvalidPenNumber | 2014 | `public static int InvalidPenNumber { get ; }` |
| Property | IsCutBackgroundPatternVisible | 2019 | `public bool IsCutBackgroundPatternVisible { get ; }` |
| Property | IsCutForegroundPatternVisible | 2019 | `public bool IsCutForegroundPatternVisible { get ; }` |
| Property | IsSurfaceBackgroundPatternVisible | 2019 | `public bool IsSurfaceBackgroundPatternVisible { get ; }` |
| Property | IsSurfaceForegroundPatternVisible | 2019 | `public bool IsSurfaceForegroundPatternVisible { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ProjectionLineColor | 2014 | `public Color ProjectionLineColor { get ; }` |
| Property | ProjectionLinePatternId | 2014 | `public ElementId ProjectionLinePatternId { get ; }` |
| Property | ProjectionLineWeight | 2014 | `public int ProjectionLineWeight { get ; }` |
| Property | SurfaceBackgroundPatternColor | 2019 | `public Color SurfaceBackgroundPatternColor { get ; }` |
| Property | SurfaceBackgroundPatternId | 2019 | `public ElementId SurfaceBackgroundPatternId { get ; }` |
| Property | SurfaceForegroundPatternColor | 2019 | `public Color SurfaceForegroundPatternColor { get ; }` |
| Property | SurfaceForegroundPatternId | 2019 | `public ElementId SurfaceForegroundPatternId { get ; }` |
| Property | Transparency | 2014 | `public int Transparency { get ; }` |